[
  {
    "word": "Sovereignty",
    "definition": "The authority of a state to govern itself without external interference."
  },
  {
    "word": "Nation-State",
    "definition": "A political unit where the state and nation are aligned geographically and culturally."
  },
  {
    "word": "Diplomacy",
    "definition": "The practice of managing international relations through negotiation and dialogue."
  },
  {
    "word": "Foreign Policy",
    "definition": "A country's strategy in dealing with other nations."
  },
  {
    "word": "Geopolitics",
    "definition": "The influence of geography on international politics and power."
  },
  {
    "word": "Realism",
    "definition": "A theory that views international relations as driven by states seeking power and security."
  },
  {
    "word": "Liberalism",
    "definition": "A theory emphasizing cooperation, institutions, and international law in global affairs."
  },
  {
    "word": "Constructivism",
    "definition": "A theory focusing on ideas, identities, and norms in shaping international relations."
  },
  {
    "word": "Hegemony",
    "definition": "Dominance of one state or group over others in international politics."
  },
  {
    "word": "Balance of Power",
    "definition": "A system where states maintain stability by ensuring no one state becomes too powerful."
  },
  {
    "word": "Treaty",
    "definition": "A formal agreement between states under international law."
  },
  {
    "word": "Alliance",
    "definition": "A formal or informal agreement between countries for mutual benefit or protection."
  },
  {
    "word": "Soft Power",
    "definition": "The ability to influence others through culture, values, and diplomacy rather than force."
  },
  {
    "word": "Hard Power",
    "definition": "The use of military or economic force to influence others."
  },
  {
    "word": "Multilateralism",
    "definition": "Cooperation between multiple countries on a given issue or policy."
  },
  {
    "word": "Unilateralism",
    "definition": "A country acting alone in international affairs, without allies or global consensus."
  },
  {
    "word": "Intervention",
    "definition": "The act of a country interfering in another’s affairs, often for political or humanitarian reasons."
  },
  {
    "word": "Sanctions",
    "definition": "Penalties applied by countries to influence the behavior of another state."
  },
  {
    "word": "Non-Governmental Organization (NGO)",
    "definition": "A non-profit group that operates independently of governments, often globally."
  },
  {
    "word": "Supranational",
    "definition": "An organization or authority that transcends national borders and exercises power over member states."
  },
  {
    "word": "Globalization",
    "definition": "The growing interdependence and integration of world economies, cultures, and populations."
  },
  {
    "word": "International Law",
    "definition": "A set of rules and norms governing relations between states and international actors."
  },
  {
    "word": "International Organization",
    "definition": "An entity formed by states to work on common interests, e.g., UN, WTO."
  },
  {
    "word": "Security Dilemma",
    "definition": "When one state's defensive actions are seen as threats by others, leading to arms races."
  },
  {
    "word": "Collective Security",
    "definition": "The idea that all states work together to respond to threats and maintain peace."
  },
  {
    "word": "National Interest",
    "definition": "A country's goals and ambitions, including economic, military, or cultural objectives."
  },
  {
    "word": "Diplomatic Recognition",
    "definition": "Acknowledgment by one state of another state's sovereignty or government."
  },
  {
    "word": "State Actor",
    "definition": "A sovereign entity that participates in international relations, typically a government."
  },
  {
    "word": "Non-State Actor",
    "definition": "An entity that participates in international relations but is not a state, e.g., terrorist groups or NGOs."
  },
  {
    "word": "Cold War",
    "definition": "A period of geopolitical tension between the U.S. and the USSR after World War II."
  },
  {
    "word": "United Nations (UN)",
    "definition": "An international organization founded to promote peace, security, and cooperation."
  },
  {
    "word": "Security Council",
    "definition": "The UN body responsible for maintaining international peace and security."
  },
  {
    "word": "Peacekeeping",
    "definition": "International deployment of troops to maintain or restore peace in conflict areas."
  },
  {
    "word": "Interdependence",
    "definition": "Mutual reliance between countries, especially economically or politically."
  },
  {
    "word": "Asylum",
    "definition": "Protection granted by a country to individuals fleeing persecution or danger."
  },
  {
    "word": "Diplomatic Immunity",
    "definition": "Legal protection granted to diplomats from prosecution in the host country."
  },
  {
    "word": "Humanitarian Intervention",
    "definition": "The use of force to prevent or end human rights violations in another country."
  },
  {
    "word": "Genocide",
    "definition": "The deliberate extermination of a national, ethnic, racial, or religious group."
  },
  {
    "word": "International Criminal Court (ICC)",
    "definition": "A court established to prosecute individuals for genocide, war crimes, and crimes against humanity."
  },
  {
    "word": "Nation",
    "definition": "A group of people sharing common culture, language, or identity, often within a state."
  },
  {
    "word": "Territorial Integrity",
    "definition": "The principle that states have the right to defend and maintain their borders."
  },
  {
    "word": "Self-Determination",
    "definition": "The right of a people to choose their own government or political status."
  },
  {
    "word": "Conflict Resolution",
    "definition": "The process of resolving disputes between nations peacefully."
  },
  {
    "word": "Bilateral",
    "definition": "Involving two countries, often used in trade or diplomatic relations."
  },
  {
    "word": "Multinational Corporation (MNC)",
    "definition": "A company that operates in multiple countries."
  },
  {
    "word": "Proxy War",
    "definition": "A conflict where major powers support different sides without direct fighting."
  },
  {
    "word": "Nuclear Proliferation",
    "definition": "The spread of nuclear weapons to countries that previously did not have them."
  },
  {
    "word": "Disarmament",
    "definition": "The reduction or elimination of military forces and weapons."
  },
  {
    "word": "Human Rights",
    "definition": "Basic rights and freedoms to which all people are entitled."
  },
  {
    "word": "Balance of Trade",
    "definition": "The difference between a country's exports and imports."
  }
]
