[
  {
    "word": "democracy",
    "definition": "A system of government where power is held by the people, usually through elected representatives."
  },
  {
    "word": "republic",
    "definition": "A state in which power is held by the people and their elected representatives, with an elected leader rather than a monarch."
  },
  {
    "word": "constitution",
    "definition": "A set of fundamental principles or laws that govern a country or organization."
  },
  {
    "word": "legislation",
    "definition": "Laws created or enacted by a legislative body."
  },
  {
    "word": "sovereignty",
    "definition": "The supreme power or authority of a state to govern itself."
  },
  {
    "word": "ideology",
    "definition": "A system of ideas and ideals, especially one that forms the basis of political theory and policy."
  },
  {
    "word": "monarchy",
    "definition": "A form of government where a king or queen rules."
  },
  {
    "word": "oligarchy",
    "definition": "A government ruled by a small group of powerful individuals."
  },
  {
    "word": "authoritarian",
    "definition": "A political system where individual freedoms are limited and power is concentrated in the hands of a leader or elite."
  },
  {
    "word": "propaganda",
    "definition": "Information used to influence public opinion, often biased or misleading."
  },
  {
    "word": "diplomacy",
    "definition": "The practice of managing international relations through negotiation and dialogue."
  },
  {
    "word": "bureaucracy",
    "definition": "A system of government with many departments and officials."
  },
  {
    "word": "federalism",
    "definition": "A political system where power is divided between a central government and regional governments."
  },
  {
    "word": "campaign",
    "definition": "A planned series of actions aimed at winning an election or influencing policy."
  },
  {
    "word": "parliament",
    "definition": "A legislative body in some countries, especially the UK."
  },
  {
    "word": "impeachment",
    "definition": "The process of charging a public official with misconduct."
  },
  {
    "word": "constituency",
    "definition": "A group of voters in a specific area who elect a representative."
  },
  {
    "word": "lobbying",
    "definition": "Attempting to influence decisions made by officials, often by special interest groups."
  },
  {
    "word": "referendum",
    "definition": "A direct vote by the public on a specific issue or policy."
  },
  {
    "word": "anarchy",
    "definition": "A state of society without government or law."
  }
]
